In [23]:
import numpy as np
import pandas as pd

from utils import random_student

In [4]:
titanic_df = pd.read_csv('titanic.csv', index_col='PassengerId')
titanic_df.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [22]:
random_student()

'Diego √Åvila'

In [24]:
x = np.array([np.nan, 2, 3, 4, 5])

In [27]:
np.nanmean(x)

3.5

In [33]:
# crear data frame con 3 columnas y 20 filas con valores aleatorios y nan distribuidos de forma aleatoria

df = pd.DataFrame(np.random.randn(20, 3), columns=list('ABC'))
df.iloc[np.random.randint(0, 20, 5), np.random.randint(0, 3, 5)] = np.nan
df.head(3)

          A         B         C
0 -0.014741  1.905984 -1.421747
1  2.009823 -1.093277  0.302418
2 -1.275366  0.553100 -0.000697

In [30]:
df.isna().head(3)

       A      B      C
0  False  False  False
1  False  False  False
2  False   True   True

In [32]:
df.notna().head(3)

      A      B      C
0  True   True   True
1  True   True   True
2  True  False  False

In [31]:
df.isnull().head(3)

       A      B      C
0  False  False  False
1  False  False  False
2  False   True   True

In [35]:
mascara_columna_a_numeros = df.A.notna()
df.A.loc[mascara_columna_a_numeros].head(10)

0    -0.014741
1     2.009823
2    -1.275366
4     0.074033
7    -1.175348
8    -0.298847
10    1.256850
11    0.570002
12    0.919887
14   -0.226267
Name: A, dtype: float64

In [36]:
random_student()

'Claudio Bahamonde'

In [40]:
valor_medio_columna_a = df.A.mean()
valor_medio_columna_a

0.06300327430446176

In [41]:
df.A.fillna(valor_medio_columna_a)

0    -0.014741
1     2.009823
2    -1.275366
3     0.063003
4     0.074033
5     0.063003
6     0.063003
7    -1.175348
8    -0.298847
9     0.063003
10    1.256850
11    0.570002
12    0.919887
13    0.063003
14   -0.226267
15    0.855854
16   -0.863064
17    1.222001
18   -1.188798
19   -0.920969
Name: A, dtype: float64

In [43]:
x = np.array([np.nan, 2, 3, 4, 5])
x.sum()

nan

In [ ]:
df = pd.read_csv('titanic.csv', index_col='PassengerId')